s='helloworld'
# 打印字符串s，并在前面和后面补空格，使其长度达到20
print('{0:*<20}'.format(s))
# 打印字符串s，并在前面补空格，使其长度达到20
print('{0:*>20}'.format(s))
# 打印字符串s，并在中间补空格，使其长度达到20
print('{0:*^20}'.format(s))

# 居中对齐
print(s.center(20))

# 千位分隔符（只适用于整数和浮点数）
print('{0:,}'.format(1234567890))
print('{0:,}'.format(1234567890.1234567890))

#浮点数小数部分的精度
print('{0:.2f}'.format(3.1415926))
print('{0:.5}'.format('hello world'))

# 整数类型
a=123
print('二进制：{0:b},八进制：{0:o},十六进制：{0:x},十进制：{0:d}'.format(a))

# 浮点数类型
b=3.1415926
print('{0:.2f},{0:.2E},{0:.2e},{0:.2%}'.format(b))